10/data/attachments/f2647f8b329ef1d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>John_wind_Friend_41234_7</nif:username>
            <nif:friendToBeRequested>soap_friends_2f7c1038-5e21-4cc2-b8a3-8c59f27f5cdc</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>